<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => '���������� ������� :attribute.',
    'accepted_if' => '���������� ������� :attribute, ����� :other ������������� :value.',
    'active_url' => '���� :attribute �������� ���������������� URL.',
    'after' => '���� � ���� :attribute ������ ���� ����� :date.',
    'after_or_equal' => '���� � ���� :attribute ������ ���� ����� ��� ������ :date.',
    'alpha' => '���� :attribute ����� ��������� ������ �����.',
    'alpha_dash' => '���� :attribute ����� ��������� ������ �����, �����, ������ � �������������.',
    'alpha_num' => '���� :attribute ����� ��������� ������ ����� � �����.',
    'array' => '���� :attribute ������ ���� ��������.',
    'ascii' => '���� :attribute ������ ��������� ������ ������������ ��������-�������� ������� � �������.',
    'before' => '���� � ���� :attribute ������ ���� �� :date.',
    'before_or_equal' => '���� � ���� :attribute ������ ���� �� ��� ������ :date.',
    'between' => [
        'array' => '���������� ��������� � ���� :attribute ������ ���� ����� :min � :max.',
        'file' => '������ ����� � ���� :attribute ������ ���� ����� :min � :max ��.',
        'numeric' => '�������� ���� :attribute ������ ���� ����� :min � :max.',
        'string' => '���������� �������� � ���� :attribute ������ ���� ����� :min � :max.',
    ],
    'boolean' => '���� :attribute ������ ����� �������� ����������� ����.',
    'can' => '���� :attribute �������� ���������������� ��������.',
    'confirmed' => '���� :attribute �� ��������� � ��������������.',
    'current_password' => '�������� ������.',
    'date' => '���� :attribute �� �������� �����.',
    'date_equals' => '���� :attribute ������ ���� �����, ������ :date.',
    'date_format' => '���� :attribute �� ������������� ������� :format.',
    'decimal' => '���� :attribute ������ ��������� :decimal ������ ����� �������.',
    'declined' => '���� :attribute ������ ���� ���������.',
    'declined_if' => '���� :attribute ������ ���� ���������, ����� :other ����� :value.',
    'different' => '���� :attribute � :other ������ �����������.',
    'digits' => '����� ��������� ���� :attribute ������ ���� :digits.',
    'digits_between' => '����� ��������� ���� :attribute ������ ���� ����� :min � :max.',
    'dimensions' => '����������� � ���� :attribute ����� ������������ �������.',
    'distinct' => '���� :attribute �������� ������������� ��������.',
    'doesnt_end_with' => '���� :attribute �� ������ ������������� ����� �� ���������: :values.',
    'doesnt_start_with' => '���� :attribute �� ������ ���������� � ������ �� ���������: :values.',
    'email' => '���� :attribute ������ ���� �������������� ����������� �������.',
    'ends_with' => '���� :attribute ������ ������������� ����� �� ���������: :values.',
    'enum' => '��������� �������� ��� :attribute ��������.',
    'exists' => '��������� �������� ��� :attribute ��� ����������.',
    'extensions' => '���� � ���� :attribute ������ ����� ���� �� ��������� ����������: :values.',
    'file' => '���� :attribute ������ ���� ������.',
    'filled' => '���� :attribute ����������� ��� ����������.',
    'gt' => [
        'array' => '���������� ��������� � ���� :attribute ������ ���� ������ :value.',
        'file' => '������ ����� � ���� :attribute ������ ���� ������ :value ��.',
        'numeric' => '�������� ���� :attribute ������ ���� ������ :value.',
        'string' => '���������� �������� � ���� :attribute ������ ���� ������ :value.',
    ],
    'gte' => [
        'array' => '���������� ��������� � ���� :attribute ������ ���� :value ��� ������.',
        'file' => '������ ����� � ���� :attribute ������ ���� ������ ��� ����� :value ��.',
        'numeric' => '�������� ���� :attribute ������ ���� ������ ��� ����� :value.',
        'string' => '���������� �������� � ���� :attribute ������ ���� :value ��� ������.',
    ],
    'hex_color' => '���� :attribute ������ ���� ���������� ����������������� ����� �����.',
    'image' => '���� :attribute ������ ���� ������������.',
    'in' => '��������� �������� ��� :attribute ��������.',
    'in_array' => '���� :attribute �� ���������� � :other.',
    'integer' => '���� :attribute ������ ���� ����� ������.',
    'ip' => '���� :attribute ������ ���� �������������� IP-�������.',
    'ipv4' => '���� :attribute ������ ���� �������������� IPv4-�������.',
    'ipv6' => '���� :attribute ������ ���� �������������� IPv6-�������.',
    'json' => '���� :attribute ������ ���� JSON �������.',
    'lowercase' => '���� :attribute ������ ���� � ������ ��������.',
    'lt' => [
        'array' => '���������� ��������� � ���� :attribute ������ ���� ������ :value.',
        'file' => '������ ����� � ���� :attribute ������ ���� ������ :value ��.',
        'numeric' => '�������� ���� :attribute ������ ���� ������ :value.',
        'string' => '���������� �������� � ���� :attribute ������ ���� ������ :value.',
    ],
    'lte' => [
        'array' => '���������� ��������� � ���� :attribute ������ ���� :value ��� ������.',
        'file' => '������ ����� � ���� :attribute ������ ���� ������ ��� ����� :value ��.',
        'numeric' => '�������� ���� :attribute ������ ���� ������ ��� ����� :value.',
        'string' => '���������� �������� � ���� :attribute ������ ���� :value ��� ������.',
    ],
    'mac_address' => '���� :attribute ������ ���� ���������� MAC-�������.',
    'max' => [
        'array' => '���������� ��������� � ���� :attribute �� ����� ��������� :max.',
        'file' => '������ ����� � ���� :attribute �� ����� ���� ������ :max ��.',
        'numeric' => '�������� ���� :attribute �� ����� ���� ������ :max.',
        'string' => '���������� �������� � ���� :attribute �� ����� ��������� :max.',
    ],
    'max_digits' => '���������� ���� � ���� :attribute �� ����� ��������� :max.',
    'mimes' => '���� � ���� :attribute ������ ����� ���� �� ��������� ����������: :values.',
    'mimetypes' => '���� � ���� :attribute ������ ����� ���� �� ��������� MIME-�����: :values.',
    'min' => [
        'array' => '���������� ��������� � ���� :attribute ������ ���� �� ����� :min.',
        'file' => '������ ����� � ���� :attribute ������ ���� �� ����� :min ��.',
        'numeric' => '�������� ���� :attribute ������ ���� �� ����� :min.',
        'string' => '���������� �������� � ���� :attribute ������ ���� �� ����� :min.',
    ],
    'min_digits' => '���������� ���� � ���� :attribute ������ ���� �� ����� :min.',
    'missing' => '���� :attribute ������ �������������.',
    'missing_if' => '���� :attribute ������ �������������, ����� :other ����� :value.',
    'missing_unless' => '���� :attribute ������ �������������, ���� :other �� ����� :value.',
    'missing_with' => '���� :attribute ������ �������������, ���� ������������ :values.',
    'missing_with_all' => '���� :attribute ������ �������������, ���� ������������ :values.',
    'multiple_of' => '�������� ���� :attribute ������ ���� ������� :value.',
    'not_in' => '��������� �������� ��� :attribute ��������.',
    'not_regex' => '�������� ������ ���� :attribute.',
    'numeric' => '���� :attribute ������ ���� ������.',
    'password' => [
        'letters' => '���� :attribute ������ ��������� ���� �� ���� �����.',
        'mixed' => '���� :attribute ������ ��������� ���� �� ���� ��������� � ���� �������� �����.',
        'numbers' => '���� :attribute ������ ��������� ���� �� ���� �����.',
        'symbols' => '���� :attribute ������ ��������� ���� �� ���� ������.',
        'uncompromised' => '��������� :attribute ��������� � ������ ������. ����������, �������� ������ :attribute.',
    ],
    'present' => '���� :attribute ������ ��������������.',
    'present_if' => '���� :attribute ������ ��������������, ����� :other ����� :value.',
    'present_unless' => '���� :attribute ������ ��������������, ���� :other �� ����� :value.',
    'present_with' => '���� :attribute ������ ��������������, ����� ������������ :values.',
    'present_with_all' => '���� :attribute ������ ��������������, ����� ������������ :values.',
    'prohibited' => '���� :attribute ���������.',
    'prohibited_if' => '���� :attribute ���������, ����� :other ����� :value.',
    'prohibited_unless' => '���� :attribute ���������, ���� :other �� ��������� � :values.',
    'prohibits' => '���� :attribute ��������� ����������� :other.',
    'regex' => '�������� ������ ���� :attribute.',
    'required' => '���� ����������� ��� ����������.',
    'required_array_keys' => '���� :attribute ������ ��������� ������ ���: :values.',
    'required_if' => '���� :attribute ����������� ��� ����������, ����� :other ����� :value.',
    'required_if_accepted' => '���� :attribute ����������� ��� ����������, ����� :other �������.',
    'required_unless' => '���� :attribute ����������� ��� ����������, ���� :other �� ��������� � :values.',
    'required_with' => '���� :attribute ����������� ��� ����������, ����� :values �������.',
    'required_with_all' => '���� :attribute ����������� ��� ����������, ����� :values �������.',
    'required_without' => '���� :attribute ����������� ��� ����������, ����� :values �� �������.',
    'required_without_all' => '���� :attribute ����������� ��� ����������, ����� �� ���� �� :values �� �������.',
    'same' => '�������� :attribute ������ ��������� � :other.',
    'size' => [
        'array' => '���������� ��������� � ���� :attribute ������ ���� ������ :size.',
        'file' => '������ ����� � ���� :attribute ������ ���� ����� :size ��.',
        'numeric' => '�������� ���� :attribute ������ ���� ������ :size.',
        'string' => '���������� �������� � ���� :attribute ������ ���� ������ :size.',
    ],
    'starts_with' => '���� :attribute ������ ���������� � ������ �� ��������� ��������: :values.',
    'string' => '���� :attribute ������ ���� �������.',
    'timezone' => '���� :attribute ������ ���� �������������� ������� ������.',
    'unique' => '����� �������� ���� :attribute ��� ����������.',
    'uploaded' => '�������� ���� :attribute �� �������.',
    'uppercase' => '���� :attribute ������ ���� � ������� ��������.',
    'url' => '���� :attribute ������ ���� �������������� URL-�������.',
    'ulid' => '���� :attribute ������ ���� �������������� ULID.',
    'uuid' => '���� :attribute ������ ���� �������������� UUID.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];

