<?php

namespace App\Lists\pages;

class AboutCompanyList
{
    public static function traitList(): array
    {
        return [
            [
                'title' => 'Направление',
                'description' => '
                    Создание и продвижение сайтов, это наше всё. Простое общение, длительное сотрудничество. 
                    К каждому проекту подходим индивидуально.
                ',
            ],
            [
                'title' => 'Поддержка',
                'description' => '
                    Предоставляем услуги по поддержке и развитию сайтов.
                    Всегда на связи, готовы оказать помощь по ведомым проектам.
                ',
            ],
            [
                'title' => 'Вовлечённость',
                'description' => '
                    Вникнем в суть вашего проекта. Предложим наиболее выгодные варианты продвижения, 
                    развития вашего сайта.
                    Ваш проект становится и нашим проектом.
                    Искренне заинтересованы в результате. Сайты делаем быстро и качественно, 
                    с функционалом любой сложности.
                ',
            ],
            [
                'title' => 'Продвижение',
                'description' => '
                    В продвижении ищем компромиссы между «белыми» и «серыми» методами. В случае возникновения проблем 
                    находим эффективные решения. <br /> <br />
                    Наши услуги по продвижению и созданию сайтов имеют отличное соотношение цены качества. 
                    Работа всегда выполняется в рассчитанные сроки. Помогаем составить техническое задание.
                ',
            ],
        ];
    }
}
